# Final Exam

* Many-to-many relationships

* Joining tables

* Nested queries

## Quiz 2

In [1]:
from reframe import Relation

r3 = Relation('/home/faculty/yasiro01/pub/R3.csv', sep=',')
r4 = Relation('/home/faculty/yasiro01/pub/R4.csv', sep=',')

place = Relation('/home/faculty/yasiro01/pub/place.csv', sep=',')
animal = Relation('/home/faculty/yasiro01/pub/animal.csv', sep=',')

In [2]:
r3

   movie_id title  year
0         1     X  1991
1         2     X  1985
2         3     Y  2006
3         4     Z  2003
4         5     Y  2006
5         6     D  2003
6         7     Z  2003

In [3]:
r4

   movie_id title  year
0         1     X  1991
1         5     Y  2006
2         2     Z  2010

### Simple operations

#### Union

In [4]:
r3.union(r4)

   movie_id title  year
0         1     X  1991
1         2     X  1985
2         3     Y  2006
3         4     Z  2003
4         5     Y  2006
5         6     D  2003
6         7     Z  2003
0         1     X  1991
1         5     Y  2006
2         2     Z  2010

In [17]:
r3.union(r4).project(['movie_id', 'title', 'year'])

   movie_id title  year
0         1     X  1991
1         2     X  1985
2         3     Y  2006
3         4     Z  2003
4         5     Y  2006
5         6     D  2003
6         7     Z  2003
2         2     Z  2010

#### Except

In [6]:
r3.minus(r4)

   movie_id title  year
1         2     X  1985
2         3     Y  2006
3         4     Z  2003
4         5     Y  2006
5         6     D  2003
6         7     Z  2003

#### Natural Join

In [7]:
r3.njoin(r4)

   movie_id title  year
0         1     X  1991
1         5     Y  2006

In [ ]:
import pandas as pd
from sqlalchemy import create_engine

# Uncomment these lines to create a table in **your** database

#conn = create_engine('postgresql://yasiro01@localhost/yasiro01')
#pd.read_csv('/home/faculty/yasiro01/pub/animal.csv', sep=',').to_sql('animal', conn)
#pd.read_csv('/home/faculty/yasiro01/pub/place.csv', sep=',').to_sql('place', conn)

In [8]:
%load_ext sql

In [9]:
%sql postgresql://yasiro01:@localhost/yasiro01

'Connected: yasiro01@yasiro01'

### Draw a table resulting from the following query:
```
select animal.name, species, place.location
from animal natural join place
where species = 'Newt'
order by place.name;
```

In [ ]:
%%sql

select animal.name, species, place.location
from animal natural join place
where species = 'Newt'
order by place.name;

### Write a SQL query that finds all animals residing in winter locations.

In [15]:
%%sql

select *
from animal natural join place
where season = 'Winter'

1 rows affected.

[(0, 1, 'Attic', 'Chunk', 34, 'Jaguar', 5, 'Winter')]

In [11]:
%%sql

select *
from animal natural join place

1 rows affected.

[(0, 1, 'Attic', 'Chunk', 34, 'Jaguar', 5, 'Winter')]

In [19]:
%%sql

select *
from animal join place on animal.location = place.location
where season = 'Winter'

4 rows affected.

[(0, 1, 'Chunk', 34, 'Jaguar', 'Attic', 0, 1, 'Attic', 5, 'Winter'),
 (4, 5, 'Wild Isotope', 28, 'Humboldt Penguin', 'Attic', 0, 1, 'Attic', 5, 'Winter'),
 (9, 10, 'Thunder', 38, 'Jaguar', 'Attic', 0, 1, 'Attic', 5, 'Winter'),
 (140, 140, 'Alice', 40, 'Aardvark', 'Attic', 0, 1, 'Attic', 5, 'Winter')]

### Write a relational algebra query that finds all animals residing in winter locations.

### Write a SQL query that finds all locations filled at 50% (or more) of their capacity.

In [16]:
%%sql

select location, count(*)
from animal
group by location

4 rows affected.

[('Garage', 1), ('Back yard', 2), ('Basement', 1), ('Attic', 4)]

In [22]:
%%sql

select location, pop, capacity, to_char(pop::decimal/capacity*100, '999.99%')
from (
    select location, count(*) pop
    from animal
    group by location
) as ppp natural join place
where pop::decimal/capacity > 0.5

1 rows affected.

[('Attic', 4, 5, '  80.00%')]